reddit_clone/app/views/posts/new.html.erb


<% Sub.all.each do |sub|  %>
---
SELECT "subs".* FROM "subs"