reddit_clone/app/models/user.rb

def reset_session_token
  self.session_token = self.class.generate_session_token
  self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "1O6XeTMdzIfpQbXbmmf6_w"], ["id", 1]]