reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "user_id", "sub_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello"], ["url", "hello"], ["content", "hello"], ["user_id", 1], ["sub_id", 1]]
---
  def create
    @post = Post.new(post_params)
    ps = PostSub.new(post_id: @post.id, sub_id: params[:sub_id])
    ps.save!