reddit_clone/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "hello"], ["password_digest", "$2a$12$8wyueEueHKBv7QeXNYvwz.kashwvz5X.kXYlk8UIB3d4jV0l.o4hW"], ["session_token", "1lyzClIerZUAQIDxX0N1Sw"]]